src/ChartsOfCharacteristicTypes/аа_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>аа_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>22</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньИерархии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.аа_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/аа_ПредопределенныеЗначения/Forms/ФормаНастроек/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодключаемыйНастройкаНажатие(Элемент)
	
	УИДНастройкиСтрокой = СтрЗаменить(СтрЗаменить(Элемент.Имя, "_", "-"), "Настройка", "");
	УИДНастройки = Новый УникальныйИдентификатор(УИДНастройкиСтрокой);
	
	Настройка = НастройкаПоУИД(УИДНастройки);
	
	ПоказатьЗначение(, Настройка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	аа_ПредопределенныеЗначения.Наименование КАК Наименование,
		|	аа_ПредопределенныеЗначения.Описание КАК Описание,
		|	аа_ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа,
		|	аа_ПредопределенныеЗначения.Родитель КАК Родитель
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|ГДЕ
		|	НЕ аа_ПредопределенныеЗначения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	аа_ПредопределенныеЗначения.УровеньИерархии";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	КэшФормы = КэшИнициализацииФормы();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			ДобавитьГруппуНастроек(Выборка, КэшФормы);
		Иначе
			ДобавитьЭлементНастройки(Выборка, КэшФормы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КэшИнициализацииФормы()
	
	Кэш = Новый Структура();
	Кэш.Вставить("ЭлементыФормы", Новый Соответствие);
	
	Возврат Кэш;
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппуНастроек(ОписаниеНастройки, КэшФормы)
	
	Родитель = Элементы.ГруппаНастройки;
	Если ЗначениеЗаполнено(ОписаниеНастройки.Родитель) Тогда
		Родитель = КэшФормы.ЭлементыФормы.Получить(ОписаниеНастройки.Родитель);
	КонецЕсли;
	
	ИмяГруппы = СтрЗаменить("Группа" + ОписаниеНастройки.Ссылка.УникальныйИдентификатор(), "-", "_");
	ГруппаНастроек = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	
	ГруппаНастроек.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроек.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ГруппаНастроек.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаНастроек.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаНастроек.ОтображатьОтступСлева = Истина;
	ГруппаНастроек.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроек.Заголовок = ОписаниеНастройки.Наименование;
	
	ГруппаНастроек.Скрыть();
	
	НоваяДекорация = Элементы.Добавить(ИмяГруппы + "Описание", Тип("ДекорацияФормы"), ГруппаНастроек);
	НоваяДекорация.Заголовок = ОписаниеНастройки.Описание;
	
	ГруппаНастроекКолонки = Элементы.Добавить(ИмяГруппы + "ЛевоПраво", Тип("ГруппаФормы"), ГруппаНастроек);
	ГруппаНастроекКолонки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроекКолонки.ОтображатьЗаголовок = Ложь;
	ГруппаНастроекКолонки.Заголовок = ОписаниеНастройки.Наименование + " (колонки)";
	ГруппаНастроекКолонки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ГруппаНастроекЛево = Элементы.Добавить(ИмяГруппы + "Лево", Тип("ГруппаФормы"), ГруппаНастроекКолонки);
	ГруппаНастроекЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроекЛево.ОтображатьЗаголовок = Ложь;
	ГруппаНастроекЛево.Заголовок = ОписаниеНастройки.Наименование + " (лево)";
	ГруппаНастроекЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроекЛево.Ширина = 45;
	
	ГруппаНастроекПраво = Элементы.Добавить(ИмяГруппы + "Право", Тип("ГруппаФормы"), ГруппаНастроекКолонки);
	ГруппаНастроекПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроекПраво.ОтображатьЗаголовок = Ложь;
	ГруппаНастроекПраво.Заголовок = ОписаниеНастройки.Наименование + " (право)";
	ГруппаНастроекПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроекПраво.Ширина = 45;
	
	КэшФормы.ЭлементыФормы.Вставить(ОписаниеНастройки.Ссылка, ГруппаНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементНастройки(ОписаниеНастройки, КэшФормы)
	
	Родитель = Элементы.ГруппаНастроекОбщие;
	Если ЗначениеЗаполнено(ОписаниеНастройки.Родитель) Тогда
		Родитель = КэшФормы.ЭлементыФормы.Получить(ОписаниеНастройки.Родитель);
	КонецЕсли;
	
	ГруппаНастроекЛево = Элементы[Родитель.Имя + "Лево"];
	ГруппаНастроекПраво = Элементы[Родитель.Имя + "Право"];
	
	ГруппаДляДобавления = ГруппаНастроекЛево;
	Если ГруппаНастроекЛево.ПодчиненныеЭлементы.Количество() > ГруппаНастроекПраво.ПодчиненныеЭлементы.Количество() Тогда
		ГруппаДляДобавления = ГруппаНастроекПраво;
	КонецЕсли;
	
	ИмяНастройки = СтрЗаменить("Настройка" + ОписаниеНастройки.Ссылка.УникальныйИдентификатор(), "-", "_");
	
	НоваяДекорация = Элементы.Добавить(ИмяНастройки, Тип("ДекорацияФормы"), ГруппаДляДобавления);
	НоваяДекорация.Заголовок = ОписаниеНастройки.Наименование;
	Новаядекорация.Подсказка = ОписаниеНастройки.Описание;
	НоваяДекорация.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	НоваяДекорация.Гиперссылка = Истина;
	НоваяДекорация.УстановитьДействие("Нажатие", "ПодключаемыйНастройкаНажатие");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаПоУИД(Знач УИДНастройки)
	
	Возврат ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.ПолучитьСсылку(УИДНастройки);
	
КонецФункции

#КонецОбласти
